#define _CRT_SECURE_NO_WARNINGS //让scanf函数可用不报错
//#pragma warning(disable:4996)
#pragma warning(disable:6031)//禁用警告提示:" C6031 返回值被忽略："scanf" "#
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>


//数据更新
//数据插入、修改、删除、空值判断语法
// 视图
// 
// 函数依赖
// 数据库可能存在的问题——数据冗余+增删改异常（更新异常）
// 原因：异常的函数依赖关系
// 完全函数依赖
// 部分函数依赖
// 传递依赖
// 平凡依赖
// 非平凡依赖
// 
// 函数依赖的概念
// 范式
// 第一范式——1NF
// 第二范式——2NF
// 第三范式——3NF
// BCNF（BC范式）
// 
// FD的逻辑蕴含
// F的闭包
// Armstrong公理系统
// Armstrong公理基本的三个规则及其五个推论
// 
// 属性集的闭包
// 
// （无损连接分解）
// （保持函数依赖分解）
// 
// 数据库设计的七个过程
// 规划、需求分析、概念设计、逻辑设计、物理设计、实现、运行和维护
// 
// ER图
// 
// 
// 