#define _CRT_SECURE_NO_WARNINGS //让scanf函数可用不报错
//#pragma warning(disable:4996)
#pragma warning(disable:6031)//禁用警告提示:" C6031 返回值被忽略："scanf" "#
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>


//查找的基本 概念、
//查找性能分析、
//
//
//顺序查找、
//折半查找
//哈希查找等。
//
//7、
//直接插入排序、
//希尔排序、
//快速排序、
//简单选择排序、
//堆排序和归并排序，
//
//各种排序方法的比较。


//数据库DB
// 数据库管理系统DBMS
// 数据定义语言DDL
// 数据操纵语言DML
// 数据控制语言DCL
// 数据库的发展阶段
//数据库系统的基本概念，
//数据库的结构化
// 数据库抽象级别
// 概念模型、逻辑模型、外部模型、内部模型
// 概念模型，实体联系模型（ER图）
// 数据模型——数据结构、数据操作、数据的完整约束条件
// 逻辑模型——层次模型、网状模型、关系模型、对象模型
//三层模式结构-两级映像、
//数据独立性等

//关系模型的基本概念，

