#define _CRT_SECURE_NO_WARNINGS //让scanf函数可用不报错
//#pragma warning(disable:4996)
#pragma warning(disable:6031)//禁用警告提示:" C6031 返回值被忽略："scanf" "#
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

//9/25--9/27日学习记录内容回忆罗列

//SQL数据库的安装，
//表的创建，删除
//增加、删除项目
//查找、修改
//限制
//表的链接
//筛选

//数据结构
// 
//栈
//队列
//双端队列
//输入受限 的双端队列
//输出受限 的双端队列
//栈的应用——括号匹配
//栈的应用——表达式求值
	//前缀表达式
	//中缀表达式
	//后缀表达式
//栈的应用——递归（函数栈）
	//函数的创建和销毁
//队列的应用
	//树的层次遍历（广度优先遍历）
	//图的广度优先遍历
	//操作系统应用


//串
//串的存储结构
//串的模式匹配算法
//KMP算法实现
//手算next数组
//数组的定义和存储结构
//


//树
//完全树和非完全树
// 二叉树
// 二叉树的性质
// 完全二叉树
// 存储结构——顺序存储
// 存储结构——链式存储（二叉链表）
// 三叉链表
// 二叉树的先、中、后序遍历
// 二叉树的层次遍历
// 线索二叉树
// 二叉树的线索化（中序线索化和后序线索化）
// 线索二叉树结点的前驱和后继
// 
// 树、森林
// 双亲表示法&孩子表示法
// 孩子兄弟表示法
// 树的遍历——先根遍历
// 树的遍历——后根遍历
// 森林的遍历——先序遍历
// 森林的遍历——后序遍历
// 哈夫曼树（最优二叉树）
// 哈夫曼树的构造——算法实现
// 哈夫曼编码
// 哈夫曼编码应用——数据压缩


//图——有向图无向图
//图的存储——邻接矩阵、邻接表
//无向图邻接矩阵——对称矩阵压缩存储
// 邻接表和邻接矩阵对于有向图无向图的比较
// 十字链表（有向图）
//邻接多重表（无向图）
//邻接多重表（无向图）
//图的基本操作
//图的广度优先遍历BFS
//图的深度优先遍历DFS

int main()
{
	return 0;
}